Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B04C.tmx
Source language: en_us
Languages: zh_cn

source: What next to tackle the riots? Curfew? Water cannon? The army?
zh_cn: 如何制止暴乱？宵禁，水枪，还是军队？

source: In the face of the riots, the beleaguered police are being bombarded as much with advice as they are with half-bricks and bottles.
zh_cn: 面对暴乱，深陷重围的警察正顶着砖块和瓶子的轰炸，与此同时，各路建议也纷乱而至。

source: So what are the options being considered and would they really help to restore order to the streets?
zh_cn: 那么究竟有哪些意见可供参考，并且它们是否真正有助于恢复街头秩序呢？

source: The curfew
zh_cn: 宵禁

source: The aim would be to keep as many people off the street as possible to allow police to concentrate on picking off the trouble-makers.
zh_cn: 宵禁的目的是让人尽可能少上街，这样一来，警察就能专心对付惹是生非的家伙。

source: The acting Met commissioner, Tim Godwin, has called for a "voluntary" curfew imposed by local communities.
zh_cn: 伦敦大都市警局的代理局长蒂姆·戈德温（Tim Godwin）已经呼吁当地社区“自发”地开展宵禁。

source: The reality is that, voluntary or compulsory, it would be almost impossible to impose and to whom would it apply - tourists? Night bus drivers? Cleaners?
zh_cn: 现实是，不论自发还是强制，宵禁几乎无法付诸实施，而且，实施的对象又是谁？游客？夜间大巴司机？清洁员？

source: How would an overstretched force decide whom to challenge?
zh_cn: 一个精疲力竭的群体怎么会有余力去针对某一帮人呢？

source: The water cannon
zh_cn: 高压水枪

source: This has been suggested by Patrick Mercer, a Conservative MP and former army officer, on the grounds that it has been successfully deployed in Northern Ireland.
zh_cn: 这个点子是保守党议员、前军官帕特里克莫策尔（Patrick Mercer）提出的，其出发点是，它在当年的北爱尔兰十分奏效。

source: The home secretary, Theresa May, has been adamant - so far - that it will not be deployed.
zh_cn: 内政大臣特雷萨梅（Theresa May）到现在为止都坚称绝不会动用高压水枪。

source: The main reason for using it is that it can disperse crowds without causing serious injury.
zh_cn: 使用高压水枪的主要原因有，它可以在不造成严重伤害的同时驱散人群。

source: The arguments against are that there are few Met officers trained in using it and that, at the current rate of spiralling violence, it would be impossible to deploy effectively.
zh_cn: 反对的理由则是，仅有极少数伦敦大都市警察接受过相关培训，而且在当前不断恶化的暴力局势面前，高压水枪几乎无法得到有效的运用。

source: Water cannon has mostly been used in dispersing people in contained spaces, not across a whole city.
zh_cn: 高压水枪主要用于在封闭的区域里驱散人群，而不是在整个城市的范围内使用。

source: The rubber or plastic bullet
zh_cn: 橡胶或塑料子弹

source: Again, this is used in Northern Ireland and credited with dispersing crowds without fatalities.
zh_cn: 同样，该措施也曾在北爱尔兰使用，可以疏散人群并不造成致命伤。

source: The Met's deputy assistant commissioner, Steve Kavanagh, has said that baton rounds - plastic bullets - could now be used: "If we need to, we will do so."
zh_cn: 伦敦大都市警局的副助理局长史蒂芬卡瓦纳（Steve Kavanagh）说过，塑料子弹现在已经可以上场了：“如果需要，我们就会出手。”

source: But shots to the head from close range can kill.
zh_cn: 不过近距离对准脑部的射击可以致命

source: Again, as with water cannon, the police would struggle to get officers trained in the use of them to the scenes of violence.
zh_cn: 至于水枪，警局会对要不要把受过训练的警察派往暴力现场而纠结不已。

source: One problem is that both water cannon and plastic bullets might merely heighten the levels of excitement for the committed rioter and looter.
zh_cn: 有一个问题，高压水枪和塑料子弹或许只会让暴乱者和抢匪的情绪更加激昂。

source: And is Northern Ireland really an example of how to keep the peace?
zh_cn: 北爱尔兰事件当真是维护和平的正面教材吗？

source: The army
zh_cn: 军队

source: The doomsday scenario for London as it prepares for the Olympics.
zh_cn: 在伦敦为奥运会备战之际，动用军队无疑是末日般的场景。

source: The army has been deployed in a civilian role during firefighters' strikes, but putting young squaddies up against their inner-city contemporaries would be a recipe for urban disaster on a scale more suitable for a graphic novel than reality.
zh_cn: 在消防队员罢工时，军队被调来发挥平民般的作用，但让年轻的新兵对抗城里的同龄人，说不定会招致都市的大灾难，其严重程度放到连环画小说中或许更合适。

source: Exactly 100 years ago, a home secretary was under pressure from the media and fellow politicians to act decisively against outrage on the streets of London.
zh_cn: 整整100年以前，一位内政大臣承受着媒体和身边政治家们的压力，需要果断地采取行动应对伦敦街头的暴乱。

source: The perpetrators then were, at least, identifiable and containable and had been tracked down to Sidney Street in the East End.
zh_cn: 至少当时警察还可以掌控那些罪犯，可以辨认他们的身份，最后追查他们至自伦敦东区。
